app/controllers/users_controller.rb

INSERT INTO "users" ("last_login_at", "updated_at", "last_request_at", "crypted_password", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "login", "email", "created_at", "last_login_ip") VALUES(NULL, '2010-06-30 08:15:03.771157', '2010-06-30 08:15:03.770521', E'e94640907f9a7dbbcefca78552a6510a87f6c1a66c2df24668fd71a9b29f30653dee2c2e6c2f9a20e6039aa03aa41ce7ba5aac10d84bd8847a80137148c47277', E'127.0.0.1', E'Hc1CoxrGYyCHvjWdbCU3', '2010-06-30 08:15:03.770346', E'a6f253d1c30e27411760fb8bbd906efb1558ab3b0870a93da1fc57b60103b44eab260aac1341a8b5fa9e43f5903c4d58df19a7bb86ab7f4a9bc448e45c5c1c1e', 1, E'darren', E'darren@darren.com', '2010-06-30 08:15:03.771157', NULL) RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "login_count" = 1, "persistence_token" = E'b3b34e6eb0465c043a351fc12e2d721b552319b375c7792f52c070c04f298d4b229ea0d464038645a0e7df32e170452d0c4b63163075291bf6b5c9ea2f7fcbce', "current_login_ip" = E'127.0.0.1', "last_request_at" = '2010-06-30 07:59:31.903329', "crypted_password" = E'478133696f0d5e4479172008934a42be5036e6d9cd4abd2c07315432ce77e515d6537d57b0fedc0a0d6edfdf500c87f057c2175deaf6c2ee2004ba47a7fd72af', "updated_at" = '2010-06-30 07:59:31.904017', "current_login_at" = '2010-06-30 07:59:31.902966', "password_salt" = E'BM8yBGSzgXcnwE_CA6yj' WHERE "id" = 3
---
  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])